fixing bug build app
